RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_adc.h
/**
 **************************************************************************
 * File Name    : at32f4xx_adc.h
 * Description  : at32f4xx ADC header file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F4xx_ADC_H
#define __AT32F4xx_ADC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup ADC
  * @{
  */

/** @defgroup ADC_Exported_Types
  * @{
  */

/**
  * @brief  ADC Init structure definition
  */

typedef struct
{
    uint32_t ADC_Mode;                      /*!< Configures the ADC to operate in independent or
                                               dual mode.
                                               This parameter can be a value of @ref ADC_mode */

    FunctionalState ADC_ScanMode;           /*!< Specifies whether the conversion is performed in
                                                   Scan (multichannels) or Single (one channel) mode.
                                                   This parameter can be set to ENABLE or DISABLE */

    FunctionalState ADC_ContinuousMode;     /*!< Specifies whether the conversion is performed in
                                                   Continuous or Single mode.
                                                   This parameter can be set to ENABLE or DISABLE. */

    uint32_t ADC_ExternalTrig;              /*!< Defines the external trigger used to start the analog
                                                   to digital conversion of regular channels. This parameter
                                                   can be a value of @ref ADC_external_trigger_sources_for_regular_channels_conversion */

    uint32_t ADC_DataAlign;                 /*!< Specifies whether the ADC data alignment is left or right.
                                               This parameter can be a value of @ref ADC_data_align */

    uint8_t ADC_NumOfChannel;               /*!< Specifies the number of ADC channels that will be converted
                                               using the sequencer for regular channel group.
                                               This parameter must range from 1 to 16. */
} ADC_InitType;
/**
  * @}
  */

/** @defgroup ADC_Exported_Constants
  * @{
  */


#if defined (AT32F403xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
#define IS_ADC_ALL_PERIPH(PERIPH)           (((PERIPH) == ADC1) || \
                                             ((PERIPH) == ADC2) || \
                                             ((PERIPH) == ADC3))
#elif defined (AT32F413xx)
#define IS_ADC_ALL_PERIPH(PERIPH)           (((PERIPH) == ADC1) || \
                                             ((PERIPH) == ADC2))
#elif defined (AT32F415xx)
#define IS_ADC_ALL_PERIPH(PERIPH)           (((PERIPH) == ADC1))
#endif


#if defined (AT32F403xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
#define IS_ADC_DMA_PERIPH(PERIPH)           (((PERIPH) == ADC1) || \
                                             ((PERIPH) == ADC3))
#elif defined (AT32F413xx) || defined (AT32F415xx)
#define IS_ADC_DMA_PERIPH(PERIPH)           (((PERIPH) == ADC1))
#endif


/** @defgroup ADC_mode
  * @{
  */

#define ADC_Mode_Independent                ((uint32_t)0x00000000)
#define ADC_Mode_RegInjecSimult             ((uint32_t)0x00010000)
#define ADC_Mode_RegSimult_AlterTrig        ((uint32_t)0x00020000)
#define ADC_Mode_InjecSimult_FastInterl     ((uint32_t)0x00030000)
#define ADC_Mode_InjecSimult_SlowInterl     ((uint32_t)0x00040000)
#define ADC_Mode_InjecSimult                ((uint32_t)0x00050000)
#define ADC_Mode_RegSimult                  ((uint32_t)0x00060000)
#define ADC_Mode_FastInterl                 ((uint32_t)0x00070000)
#define ADC_Mode_SlowInterl                 ((uint32_t)0x00080000)
#define ADC_Mode_AlterTrig                  ((uint32_t)0x00090000)

#define IS_ADC_MODE(MODE)                   (((MODE) == ADC_Mode_Independent) || \
                                             ((MODE) == ADC_Mode_RegInjecSimult) || \
                                             ((MODE) == ADC_Mode_RegSimult_AlterTrig) || \
                                             ((MODE) == ADC_Mode_InjecSimult_FastInterl) || \
                                             ((MODE) == ADC_Mode_InjecSimult_SlowInterl) || \
                                             ((MODE) == ADC_Mode_InjecSimult) || \
                                             ((MODE) == ADC_Mode_RegSimult) || \
                                             ((MODE) == ADC_Mode_FastInterl) || \
                                             ((MODE) == ADC_Mode_SlowInterl) || \
                                             ((MODE) == ADC_Mode_AlterTrig))
/**
  * @}
  */

/** @defgroup ADC_external_trigger_sources_for_regular_channels_conversion
  * @{
  */

#define ADC_ExternalTrig_TMR1_CC1_ADC12             ((uint32_t)0x00000000) /*!< For ADC1 and ADC2 */
#define ADC_ExternalTrig_TMR1_CC2_ADC12             ((uint32_t)0x00020000) /*!< For ADC1 and ADC2 */
#define ADC_ExternalTrig_TMR2_CC2_ADC12             ((uint32_t)0x00060000) /*!< For ADC1 and ADC2 */
#define ADC_ExternalTrig_TMR3_TRGO_ADC12            ((uint32_t)0x00080000) /*!< For ADC1 and ADC2 */
#define ADC_ExternalTrig_TMR4_CC4_ADC12             ((uint32_t)0x000A0000) /*!< For ADC1 and ADC2 */
#define ADC_ExternalTrig_Ext_INT11_TMR8_TRGO_ADC12  ((uint32_t)0x000C0000) /*!< For ADC1 and ADC2 */
#define ADC_ExternalTrig_TMR8_CC1_ADC12             ((uint32_t)0x020C0000) /*!< For ADC1 and ADC2 */
#define ADC_ExternalTrig_TMR8_CC2_ADC12             ((uint32_t)0x020E0000) /*!< For ADC1 and ADC2 */

#define ADC_ExternalTrig_TMR1_CC3                   ((uint32_t)0x00040000) /*!< For ADC1, ADC2 and ADC3 */
#define ADC_ExternalTrig_None                       ((uint32_t)0x000E0000) /*!< For ADC1, ADC2 and ADC3 */
#define ADC_ExternalTrig_TMR15_CC1                  ((uint32_t)0x02000000) /*!< For ADC1, ADC2 and ADC3 */
#define ADC_ExternalTrig_TMR15_CC2                  ((uint32_t)0x02020000) /*!< For ADC1, ADC2 and ADC3 */
#define ADC_ExternalTrig_TMR15_CC3                  ((uint32_t)0x02040000) /*!< For ADC1, ADC2 and ADC3 */
#define ADC_ExternalTrig_TMR15_CC4                  ((uint32_t)0x02060000) /*!< For ADC1, ADC2 and ADC3 */
#define ADC_ExternalTrig_TMR15_TRGO                 ((uint32_t)0x02080000) /*!< For ADC1, ADC2 and ADC3 */
#define ADC_ExternalTrig_TMR1_TRGO                  ((uint32_t)0x020A0000) /*!< For ADC1, ADC2 and ADC3 */

#define ADC_ExternalTrig_TMR3_CC1_ADC3              ((uint32_t)0x00000000) /*!< For ADC3 only */
#define ADC_ExternalTrig_TMR2_CC3_ADC3              ((uint32_t)0x00020000) /*!< For ADC3 only */
#define ADC_ExternalTrig_TMR8_CC1_ADC3              ((uint32_t)0x00060000) /*!< For ADC3 only */
#define ADC_ExternalTrig_TMR8_TRGO_ADC3             ((uint32_t)0x00080000) /*!< For ADC3 only */
#define ADC_ExternalTrig_TMR5_CC1_ADC3              ((uint32_t)0x000A0000) /*!< For ADC3 only */
#define ADC_ExternalTrig_TMR5_CC3_ADC3              ((uint32_t)0x000C0000) /*!< For ADC3 only */
#define ADC_ExternalTrig_TMR1_CC1_ADC3              ((uint32_t)0x020C0000) /*!< For ADC3 only */
#define ADC_ExternalTrig_TMR8_CC3_ADC3              ((uint32_t)0x020E0000) /*!< For ADC3 only */

#define IS_ADC_EXT_TRIG(REGTRIG)                    (((REGTRIG) == ADC_ExternalTrig_TMR1_CC1_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR1_CC2_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR2_CC2_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR3_TRGO_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR4_CC4_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_Ext_INT11_TMR8_TRGO_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR8_CC1_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR8_CC2_ADC12) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR1_CC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_None) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR15_CC1) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR15_CC2) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR15_CC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR15_CC4) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR15_TRGO) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR1_TRGO) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR3_CC1_ADC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR2_CC3_ADC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR8_CC1_ADC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR8_TRGO_ADC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR5_CC1_ADC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR5_CC3_ADC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR1_CC1_ADC3) || \
                                                     ((REGTRIG) == ADC_ExternalTrig_TMR8_CC3_ADC3))
/**
  * @}
  */

