RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_adc.h
#define IS_ADC_EXT_INJEC_TRIG(INJTRIG)              (((INJTRIG) == ADC_ExternalTrigInjec_TMR2_TRGO_ADC12) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR2_CC1_ADC12) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR3_CC4_ADC12) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR4_TRGO_ADC12) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_Ext_INT15_TMR8_CC4_ADC12) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR8_CC1_ADC12) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR1_TRGO) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR1_CC4) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_None) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR15_CC1) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR15_CC2) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR15_CC3) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR15_CC4) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR15_TRGO) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR1_CC1) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR8_TRGO) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR4_CC3_ADC3) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR8_CC2_ADC3) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR8_CC4_ADC3) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR5_TRGO_ADC3) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR5_CC4_ADC3) || \
                                                     ((INJTRIG) == ADC_ExternalTrigInjec_TMR1_CC2_ADC3))

/**
  * @}
  */

/** @defgroup ADC_injected_channel_selection
  * @{
  */

#define ADC_InjectedChannel_1                       ((uint8_t)0x14)
#define ADC_InjectedChannel_2                       ((uint8_t)0x18)
#define ADC_InjectedChannel_3                       ((uint8_t)0x1C)
#define ADC_InjectedChannel_4                       ((uint8_t)0x20)
#define IS_ADC_INJECTED_CHANNEL(CHANNEL)            (((CHANNEL) == ADC_InjectedChannel_1) || \
                                                     ((CHANNEL) == ADC_InjectedChannel_2) || \
                                                     ((CHANNEL) == ADC_InjectedChannel_3) || \
                                                     ((CHANNEL) == ADC_InjectedChannel_4))
/**
  * @}
  */

/** @defgroup ADC_analog_watchdog_selection
  * @{
  */

#define ADC_AnalogWDG_SingleRegEnable               ((uint32_t)0x00800200)
#define ADC_AnalogWDG_SingleInjecEnable             ((uint32_t)0x00400200)
#define ADC_AnalogWDG_SingleRegOrInjecEnable        ((uint32_t)0x00C00200)
#define ADC_AnalogWDG_AllRegEnable                  ((uint32_t)0x00800000)
#define ADC_AnalogWDG_AllInjecEnable                ((uint32_t)0x00400000)
#define ADC_AnalogWDG_AllRegAllInjecEnable          ((uint32_t)0x00C00000)
#define ADC_AnalogWDG_None                          ((uint32_t)0x00000000)

#define IS_ADC_ANALOG_WDG(WDG)                      (((WDG) == ADC_AnalogWDG_SingleRegEnable) || \
                                                     ((WDG) == ADC_AnalogWDG_SingleInjecEnable) || \
                                                     ((WDG) == ADC_AnalogWDG_SingleRegOrInjecEnable) || \
                                                     ((WDG) == ADC_AnalogWDG_AllRegEnable) || \
                                                     ((WDG) == ADC_AnalogWDG_AllInjecEnable) || \
                                                     ((WDG) == ADC_AnalogWDG_AllRegAllInjecEnable) || \
                                                     ((WDG) == ADC_AnalogWDG_None))
/**
  * @}
  */

/** @defgroup ADC_interrupts_definition
  * @{
  */

#define ADC_INT_EC                                  ((uint16_t)0x0220)
#define ADC_INT_AWD                                 ((uint16_t)0x0140)
#define ADC_INT_JEC                                 ((uint16_t)0x0480)

#define IS_ADC_INT(INT)                             ((((INT) & (uint16_t)0xF81F) == 0x00) && ((INT) != 0x00))

#define IS_ADC_GET_INT(INT)                         (((INT) == ADC_INT_EC) || ((INT) == ADC_INT_AWD) || \
                                                     ((INT) == ADC_INT_JEC))
/**
  * @}
  */

/** @defgroup ADC_flags_definition
  * @{
  */

#define ADC_FLAG_AWD                                ((uint8_t)0x01)
#define ADC_FLAG_EC                                 ((uint8_t)0x02)
#define ADC_FLAG_JEC                                ((uint8_t)0x04)
#define ADC_FLAG_JSTR                               ((uint8_t)0x08)
#define ADC_FLAG_RSTR                               ((uint8_t)0x10)
#define IS_ADC_CLEAR_FLAG(FLAG)                     ((((FLAG) & (uint8_t)0xE0) == 0x00) && ((FLAG) != 0x00))
#define IS_ADC_GET_FLAG(FLAG)                       (((FLAG) == ADC_FLAG_AWD) || ((FLAG) == ADC_FLAG_EC) || \
                                                     ((FLAG) == ADC_FLAG_JEC) || ((FLAG)== ADC_FLAG_JSTR) || \
                                                     ((FLAG) == ADC_FLAG_RSTR))
/**
  * @}
  */

/** @defgroup ADC_thresholds
  * @{
  */

#define IS_ADC_THRESHOLD(THRESHOLD)                 ((THRESHOLD) <= 0xFFF)

/**
  * @}
  */

/** @defgroup ADC_injected_offset
  * @{
  */

#define IS_ADC_OFFSET(OFFSET)                       ((OFFSET) <= 0xFFF)

/**
  * @}
  */

/** @defgroup ADC_injected_length
  * @{
  */

#define IS_ADC_INJECTED_LENGTH(LENGTH)              (((LENGTH) >= 0x1) && ((LENGTH) <= 0x4))

/**
  * @}
  */

/** @defgroup ADC_injected_rank
  * @{
  */

#define IS_ADC_INJECTED_RANK(RANK)                  (((RANK) >= 0x1) && ((RANK) <= 0x4))

/**
  * @}
  */


/** @defgroup ADC_regular_length
  * @{
  */

